# OSPF (Open Shortest Path First)
- Protocolo de enrutamiento dinámico
- Puede ocuparlo cualquier marca, a diferencia de RIP.
- En SPF no existe la desventaja que después de 15 saltos (RIP) ya no es tan óptimo
- Distancia Admin. = 110
- Métrica = Costo (Bw referencia/Bw interfaz) = (10^8/Bw interfaz)
- Recordemos que la métrica entre menos sea es más confiable.

 **Adyacencia**
Tiempo que tardan los routers en saludarse = "Hello" = 10 seg (por defecto)

**Convergencia** 
Tiempo donde se comparten la información del enrutamiento = "Dead" = 4 seg

## Tablas
``#sh ip route
``#sh ip ospf neighbor `` Es la tabla de adyacencia
``#sh ip ospf detabase``

OSPF trabaja por áreas. Área principal de OSPF es 0 o backon, y apartir de ahí es donde se empieza a enrutar. 

## Network Type
1. Point to point, para topologias con redes WAN. Siempre tendrá *prioridad 0* (No hay DR).
2. Broadcast, para topologías dentro de una red WAN. Siempre *prioridad será 1* (Contienda)

## Prioridades

| 0   | No hay DR                          |
| --- | ---------------------------------- |
| 1   | Contienda                          |
| 2   | Obliga a ser Router Designado (DR) |

### Router Designado
Creado para evitar un número de adyacencias mayor. Y hacer el proceso de convergencia más rápido. Esto ayuda a que OSPF sea más rápido.
Existen métodos para designar el DR:
1. IP interfaz
2. IP Loopback
3. Router-id manual (Solo es un identificador de 32 bits)
*BDR*, Backup Router, sería el que esta 1 atrás del designado. Ej: DR = 1.4 -**>** BDR = 1.3

Las adyacencias ahora serían los demás routers mandarían los mensajes de adyacencia únicamente al DR y BDR, en el caso del BDR solo al DR.

Convergencia, tiempo que el DR distribuye y actualiza a todos.

### LoopBack
![[1.JPG]]
Es una interfaz/IP virtual en el Router, usada para hacer pruebas o realizar conexión remotas. También para usar DR. 
``` js
R1(conf)#router ospf 1
		#network "segmento de red" "wildcard"
		#netwrok 192.168.1.0 0.0.0.255 area 0

R1(conf)#router ospf 1
		#network "segmento de red" "wildcard"
		#netwrok 192.168.1.0 0.0.0.255 area 0
		#netwrok 192.168.2.0 0.0.0.255 area 0
```
Mask - 255.255.255.0 = *0.0.0.255 Wildcard* 

*O*: segmentos de red aprendidos por OSPF dentro del segmento
*O\**: Hay una ruta estática por defecto aprendida
*OIA*: Aprendida por otra área

```js
R1#sh ip route
R1#sh ip ospf interface se0/0/0
R1#sh ip ospf neighbor //Tabla de vecinos
R1#sh ip ospf database //Tipos de LSA
	//LSA Tipo 1. Muestra todos los routers de la misma área
```

## Configurar DR
![[2.JPG]]
```js
R1(conf)#router opsf 1
		#network 192.168.1.0 0.0.0.255 area 0
		#router-id 1.1.1.1
```

``R1#sh ip ospf neighbor``
![[3.JPG]]
``R4#sh ip ospf neighbor``
![[4.JPG]]
``#sh ip ospf database``
![[5.JPG]]

---
# ACL (Access Control List)
Configurados en routers o sw de capa 3
- Permiten o deniegan un servicio de la red
- Router funciona como firewall

| Estandar                                         | Extendida                                  |
| ------------------------------------------------ | ------------------------------------------ |
| Se enumeran de 1 a 99                            | Se enumeran de 100 a 199                   |
| Se recomienda configurar lo más cerca al destino | Se recomienda conf. lo más cerca al origen |
| Permite o bloquea todos los servicios            | Permite o bloquea protocolos en específico |
| Configura IP origen                              | Configura IP origen y destino              |
### Bloqueando usando ACL Estándar
```js
Rx(conf)#acces-list "número" permit/deny host/segmento de red/any wildcard

R2(conf)#access-list 1 deny host 192.168.1 //solo se bloquea ip 1.1
R2(conf)#access-list 1 192.1681.0 0.0.0.255 // se niega el segmento
R2(conf)#access-list 1 deny any
//Se recomienda poner después
R2(conf)#access-list 1 permit any

-------------------------------------------------------
Para aplicar los cambios
R2(conf)#interface fa0/0
		#ip acces-group 1 in 

```
- host = IP en específico
- segmento de red solo va con wildcard
- any = todo

### Bloqueando con ACL Extendida
Se debe configurar la IP origen y destina. 
Recordemos que: _Se recomienda configurar lo más cerca al origen_

Ejercicio: bloquear el accesso de la IP 1.1 al server

```js
Rx(conf)#acces-list "número" permit/deny host/segmento de red/any wildcard

R1(conf)#access-list 105 deny tcp host 192.168.1.1 host 192.168.4.1 eq 80
R1(conf)#access-list 105 permit ip any any

-------------------------------------------------------
Para aplicar los cambios
R1(conf)#interface fa0/0
		#ip acces-group 105 in

```

---
# NAT (Netwrok Address Translation)
- Traducción de IP's privadas a públicas
- Tipos:
	- Estático, IP 
	- Dinámico, se crea un pool que quieres que traduzca
	- Sobreflujo (PAT), 

## Nateo de sobreflujo PAT
Muchas direcciones Ip's pueden ser traducidas a una sola, por lo que ocupará puertos (puerto libres). 

```js
R2(conf)#router ospf 1
		#no network 192.168.4.0 0.0.0.255 area 0

--------------------------------------------------
R2(conf)#access-list 2 permit any
		#ip nat inside source list interface gig0/0/1 overload
		#interface gig0/0/0
		#ip nat inside //interfaz de entrada
		#exit
		#interface gig0/0/1 //interfaz de salida
		#ip nat outside
		#exit
```