
Comando de ayuda para equipos CISCO
```js

Exec commands:

connect Open a terminal connection
disable Turn off privileged commands
disconnect Disconnect an existing network connection
enable Turn on privileged commands
exit Exit from the EXEC
...
```
***
## Modo Usuario
Siempre se empieza por modo usuario
```js
Router> ? //Mostrará los comandos de router disponibles
Switch> ?
```
***
## Modo privilegiado
Pasar a modo privilegiado

```js
Router> enable
Router#
---
Switch> enable
Switch#
```

Versión
```js
Router#show version
---
Switch#show version
```

Revisar configuración del equipo y en **modo config**
```js
Router#show running-config
Router#sh runn
---
Bruce(config)#do sh runn
```

## Modo de configuración global
Para pasar a modo configuración global router/switch
```js
Router#configure terminal 
Router(config)#
```
Revisar configuración del equipo
```js
Router(config)# do sh runn
```

Agregar pass al equipo y borrarla router/switch.
Nota: se agrega password para acceder al modo privilegiado.
```js
Router(config)#enable password cisco //Pone pass cisco
Router(config)#no enable password  //Quita pass al equipo
```
Cambiar hostname router/switch
```js
Router(config)#hostname David
```
---
# Internet Protocol (IP)
Identificador en los dispositivos
> IPv4 = 32 bits -> 192.168.1.1, acompañada de máscara de subred 255.255.255.0
> IPv6 = -> 

---
### Configurando IP
Configurar una IP en un router
```js
David(config)#interface gi/0/0/0
David(config-if)#ip address 192.168.1.10 255.255.255.0
//En este caso se utilizará la máscara 255.255.255.0 por defecto
David(config-if)#no shutdown
//Importante para activar la IP
```

Configurar IP en switch

```js
Switch>enable
Switch#conf t
Switch(config)#interface vlan 1
Switch(config-if)#ip address 192.168.1.100 255.255.255.0
Switch(config-if)#no shutdown
```
---
# Tipos de contraseña

- 0 Texto claro (`password`)
- 5 Transformada Hash MD5 (`David(config)# username jose secret cisco`)
- 7 Cifrado de cisco (`David(config)#service password-encryption`) 
- 8 y 9 Cifrado RSA AES
---
## Configuración contraseñas
Configurar usuario y contraseña para consola.
```js
David(config)#username deibyd password cisco
```

Configurar puerto consola, al realizar esto se solicitará usuario y contraseña desde el CLI o bien terminal.  Es decir, se protege el acceso al modo EXEC del usuario o "Modo Usuario".
```js
David(config)#line console 0 //El 0 representa la primera (y casi siempre única) interfaz de consola
David(config-line)#login local // Todos los usuarios locales pueden conectarse por consola
*Nota: se accedera por medio de usuario y contraseña*
---
David(config)#line console 0 //El 0 representa la primera (y casi siempre única) interfaz de consola
David(config-line)#password cisco //Se pone una contraseña sin necesidad de tener un user
David(config-line)#login // Se establece que al hacer login pida la contraseña sin necesidad de user
*Nota: preferible usar la de arriba, ya que al habilitar Telnet se usa un USER*
```

Ver establecer **password para el modo privilegiado.**

Guardar configuración del equipo, ==en simulación sí, equipo no==
```js
David#copy running-config startup-config
David#write
```

Reiniciar dispositivo 
```java
David#reload
```
---
# Líneas Virtuales
## Telnet
Agregar líneas virtuales router/switch, las cuáles permiten el acceso remoto mediante **Telnet** o SSH al dispositivo.
### Pasos para "Habilitar Telnet"
	1. Crear usuario y constraseña
	2. Configurar IP
	3. Habilitar líneas virtuales
**Router**
```js
David(config)# //Configurar IP
David(config)# //Usuario y contraseña
David(config)# //Habilitar líneas virtuales
David(config)#line vty 0 15 //Por defecto, pueden estar hasta 16 usuarios conectados al mismo tiempo
David(config-line)#login local
```

**Switch**
```js
Switch(config)# //Configurar IP
Switch(config)# //Usuario y contraseña
Switch(config)#username admin secret cisco
Switch(config)#line vty 0 2 //3 usuarios
Switch(config-line)#login local
Switch(config-line)#exit
Switch(config)#enable secret cisco
```

Conexión desde Windows
```bash
C:\>telnet 192.168.1.100
C:\>telnet 192.168.1.10
```

---
# Tipos de cable

### Cable directo ___________________
> PC->Ruter
> Switch-> Router

### Cable cruzado ----
> Switch-> Switch
> Router-> Router
> Pc -> Router

---
# Tarjeta de red
Dirección MAC = Dirección física
Tiene 48 bits en hexadecimal

---

# Formas de administración
| Consola | Línea virtual |
| ---- | ---- |
| Físicamente desde consola | Forma de conectarte remotamente sin necesidad de estar físicamente |
|  | Telnet y SSH |

---



