# Introducción
## Modelo Jerárquico
Estructura o tipo de topología
- Consta de 3 capas divididas mediante Switches.
- Incluye calidad de servicios, tolerancia a fallos, escalabilidad, etc.

No todos los dispositivos van a un solo switch, sino existen varios switches.

*Switch Core*: switch principal porque este switch permite conexión hacia al exterior, puede tener servidores o bien puede ser utilizado para sacarnos al exterior (internet).

| Capa de Núcleo       | Tiene la comunicación directa con el exterior ya sea con Router o con otro tipo de esquema *"Modelo de tipo Nucleo Contraído* |
| -------------------- | ----------------------------------------------------------------------------------------------------------------------------- |
| Capa de Distribución | Reenvía la trama hacia el núcleo o acceso. Toma un poco de la carga de Acceso y Núcleo.                                       |
| Capa de Acceso       | Distribuye información hacia dispositivos. Dispositivos Finales.                                                              |
![[valns1.JPG]]
### Capa Núcleo y Distribución
#### SW Núcleo Contraído
Se quita capa de distribución y se ocupa un Switch de capa 3 funciona como switch (capa 2) y como router (capa 3).

>Como buena práctica se sugiere tener host y server en diferentes segmentos de red, ya que se pueden tener más switches al mismo nivel de Acceso

*Stack de Switches,* apilamiento de switches, se pueden tener dos switches conectados entre si y _fusionarlos_ 24 puertos + 24 puertos, mediante una configuración y de esta forma se consigue un SW de 48 puertos.

![[vlans2.JPG]]

### Capa de núcleo 
Es la que esta conectada a exterior.

![[vlans3.JPG]]

# VLANS
LANS Virtuales
- Siguen estándar 802.3
- Ethernet
- Son redes creadas de manera virtual, gracias a los switches.
- Interactúan en la capa 2 del #OSI 
- Rangos
	- Rango normal: 1 a 1005
	- Rango extendido: 1006 a 4094
- Número máximo de VLANS son 2096
- Almacenadas en un archivo "vlan.dat" en la NVRAM
- Tenemos VLANS de datos y de voz
- `# show vlan brief`
- Dos formas de colocar los puertos del switch
	- Modo Acceso: Solo permite el tráfico de 1 VLAN
	- Modo Troncal: Tiene ventaja que permite tráfico de 1 o más VLANS

> ¿Para que VLANS?
> En la parte de seguridad separan por departamentos cada área en la red, se tiene mejor estructurada la red y se puede dar un direccionamiento privado. 
> 
> ==Por cada VLAN un segmento de RED diferente, dominio broadcast diferente== por defecto es la VLAN 1.

Por defecto el enlace de los host/servers conectados al de Capa de Acceso debe ser *modo access*, y el enlace de sw de Capa de Núcleo al router *modo trunk*.


## Comandos
 ```java
 switch# sh vlan brief
```
Muestra las VLANs creadas, nombre, status y puertos que pertenecen.
La VLAN 1 viene creada por defecto y desde el puerto fa0/0 - fa0/24 y gi0/0 - gi 0/1 
Además las vlans por defecto 
- 1002
- 1003
- 1004
- 1005
Estas anteriores incluyendo la 1 no se pueden modificar.

```java
switch# conf t
switch(config)# vlan 20 //Crea la VLAN 20
switch(config)# name vlan20 //Asigna nombre a VLAN 20
.
.
.
//Asignar puertos
switch(config)# no vlan 30 //Borra la VLAN 20
switch(config)# interface fa0/1 //Nos vamos a la interfaz
switch(config-if)# switchport mode access  //Ese puerto se encuentra en modo acceso
switch(config-if)# switchport acces vlan 20 //Asigan esa interfaz la VLAN 20

```

Recordemos que cada VLAN es un segmento de red diferente, por lo tanto, si hacemos un ping entre dos hosts de diferentes VLANS no podría darse.

Si conectamos un SW necesitariamos dos enlaces uno para el tráfico de la Vlan 10 y Vlan 20.
![[vlans4.JPG]]
Para permitir que la PC de la Vlan 10 se comunica con la de la Vlan 10 pero del otro switch:
A los puertos Fa0/1-2 se le asigna la Vlan 10 también y al estar conectadas con la interfaz Fa0/5 donde previamente ya estaba la Vlan 10, ahí se establece la conexión. *Nota:* previamente se creo la VLAN

```java
Switch(config)#interface range fa0/1-fa0/2

Switch(config-if-range)#switchport mode access

Switch(config-if-range)#swi

Switch(config-if-range)#switchport acces vlan 10

Switch(config-if-range)#exit
```

Desventajas de laconf anterior, necesitamos un enlace por cada tráfico de VLAN, por el modo acceso.

### Trunk
- usa protocolo 802.1q
- `#sh running-config`
- `#sh interfaces trunk`
En `sh vlan brief` solo se visualiza los puertos en modo acceso

```java
S3(config)#interface fa0/1

S3(config-if)#swi

S3(config-if)#switchport mode trunk //Se establece el puerto en modo Trunk

S3(config-if)#exit
---------------------------------------------------------------------------
S3(config)#interface fa0/1

S3(config-if)#swi

S3(config-if)#switchport trunk allowed vlan 10,20 //prmite tráfico de esas VLANS

S3(config-if)#no switchport trunk allowed vlan 10,20
```
![[vlans5.JPG]]
El enlace trunk, la trama o msg viaja con *etiqueta*. 
Pero si se aplica la VLAN nativa viaj *etiqueta*.
### Vlan Nativa
```java
Switch(config)#interface fa0/1

Switch(config-if)#swi

Switch(config-if)#switchport mode trunk

Switch(config-if)#

Switch(config-if)#swi

Switch(config-if)#switchport trunk native vlan 99

Switch(config-if)#end
```

---

# Router on Stick
Es enrutamiento entre VLANS, ayuda a comunicar VLANS.
*Importante hacer primero las VLANS lógicas y luego las físicas*
``` java 
//X representa el número de interfaz y V el número de VLAN
(conf)#interfce fax/x V
(conf-if)#encapsulamiento dot1q V
//Hacer process que ya conocemos asignar ip, etc.
(conf-if)#exit
(conf)#interface fax/x
(conf)#no shutdown
```

Ahora si:
```java
Router(config)#interface gi0/0/0

Router(config-if)#exit

Router(config)#interface gi0/0/0.10

Router(config-subif)#encapsulation dot1Q 10

Router(config-subif)#ip address 192.168.10.254 255.255.255.0

Router(config-subif)#exit
---------------------------------------------------------------------
Router(config)#interface gi0/0/0.20

Router(config-subif)#encapsulation dot1Q 20

Router(config-subif)#ip address 192.168.20.254 255.255.255.0

Router(config-subif)#exit
----------------------------------------------------------------------
Router(config)#interface gi0/0/0

Router(config-if)#no shutdown
```

Para verificar las interfaces up/down
`sh ip interface brief`

---
# INTER VLAN ROUTING

El switch que esta en capa 2 y 3.
```java
Switch(config)#hostname CORE

CORE(config)#vlan 5

CORE(config-vlan)#vlan 23

CORE(config-vlan)#exit

CORE(config)#interface vlan 5

CORE(config-if)#ip addres 192.168.5.254 255.255.255.0

CORE(config-if)#no shutdown

CORE(config-if)#exit
---------------------------------------------------------
CORE(config)#interface vlan 23

CORE(config-if)#

CORE(config-if)#ip addres 192.168.23.254 255.255.255.0

CORE(config-if)#no shutdown

CORE(config-if)#exit
```

Para habilitar el enlace modo Trunk
1. No podemos como en SW de capa 2 porque viene con encapsulación modo "auto"
2. Habilitar la encapsulación Trunk
	1. `switchport trunk encapsulation dot1q`
3.  Habilitar el enlace trunk

Habilitar enrutamiento
`ip routing`
```java
CORE(config)#interface fa0/1

CORE(config-if)#switchport trunk encapsulation dot1q

CORE(config-if)#switchport mode trunk

CORE(config-if)#ip routing

CORE(config)#ip routing
```
![[vlans6.JPG]]


| Router on Stick         | CORE                   |
| ----------------------- | ---------------------- |
| Subinterfaces           | Vlans con IP           |
| interfaces logicas      | Habilitar enrutamiento |
| habilitar encapsulacion |                        |
De igual forma, si queremos hacer que alguna interfaz del CORE se comporte como Router se pone:
```java
CORE(config)#interface fa0/2

CORE(config-if)#no switchport

CORE(config-if)#ip address 192.168.200.1 255.255.255.0 //Solo para verificar que ya se puede trabajar como router
```