#Etherchannel

![[route1.JPG]]
![[route3.JPG]]

``` css
1. Rx(conf)# ip route "segmento de red" "mascara" "next hop (IP)"
R1(config)#ip route 192.168.3.0 255.255.255.0 192.168.2.2
R2(config)#ip route 192.168.1.0 255.255.255.0 192.168.2.1

3. Rx(conf)# ip route "segmento de red" "mascara" "interfaz local"
R3(config)#ip route 192.168.1.0 255.255.255.0 se0/0/0
R4(config)#ip route 192.168.3.0 255.255.255.0 se0/0/0
```

![[route2.JPG]]
[] = distancia administrativa
1 = valor por default de enrutamiento estático
2 = métrica del estático que es 0

---
## Rutas estáticas flotantes
Rutas donde se puede modificar las distancias administrativas para poder tener *tolerancia a fallos*
![[route4.JPG]]

``` css
1. Rx(conf)# ip route "segmento de red" "mascara" "next hop (IP)" "metrica"
R1(config)#ip route 192.168.3.0 255.255.255.0 192.168.2.2 200
R1(config)#ip route 192.168.4.0 255.255.255.0 192.168.2.1 200

1. Rx(conf)# ip route "segmento de red" "mascara" "next hop (IP)" "metrica"
R2(config)#ip route 192.168.1.0 255.255.255.0 192.168.2.1 200
R2(config)#ip route 192.168.4.0 255.255.255.0 192.168.3.1 200

/*Con la intención que el ping regrese por abajo*/
1. Rx(conf)# ip route "segmento de red" "mascara" "next hop (IP)" "metrica"
R3(config)#ip route 192.168.5.0 255.255.255.0 192.168.6.2 100
R2(config)#ip route 192.168.1.0 255.255.255.0 192.168.6.2 100
```

![[route5.JPG]]
Se observa como el valor de la distancia administrativa es de 200.

![[route6.JPG]]

---
### Ruta estática por defecto
Usada para enrutar la salida hacia internet

`Rx (conf)# ip route 0.0.0.0 0.0.0.0 next hop`
- Todos los segmentos de red
- Todas las máscaras de subred

*Nota: para internet no se enruta con RIP pq son muchos segmentos

``` css
R1(config)#router rip

R1(config-router)#network 192.168.2.0

R1(config-router)#network 192.168.1.0
-------------------------
R2(config)#router rip

R2(config-router)#network 192.168.2.0

R2(config)#ip route 0.0.0.0 0.0.0.0 192.168.3.1
```

#### Default information originate
Propagar el enrutamiento dinámico (RIP y OSPF) hacia la ruta estática por defecto. Este comando **solo se debe configurar en el router que da salida hacia internet.**
`R2(conf)# router rip`
`R2(conf-route)# default-information originate`

![[route7.JPG]]
==S*== ruta estatica por defecto 
![[route8.JPG]]
==R*== indica que existe un ruta estática por defecto, aunque no esta en este router

---
# Etherchannel
- Aumentar velocidad y ancho de banda
- Se puede tener un número máximo de 6 etherchannel y 8 interfaces
- LACP = general
- PaGP = cisco
- Se necesita la misma velocidad, duplex e información de vlans

| LACP       | Active     | Pasive  |
| ---------- | ---------- | ------- |
| Active     | Si         | Si      |
| Passive    | Si         | No      |
| ---------- | ---------- | ------- |
| PaGP       | Desirable  | Auto    |
| Desirable  | Si         | Si      |
| Autp       | Si         | No      |

```css 
/*Desde configuración global*/
#interface range fa0/x - x
#channel-group X mode Y
#interface port-channel X
#swithcport mode trunk

----------------------------------------------
S1(config)#interface range fa0/1-3

S1(config-if-range)#channel-group 1 mode active

S1(config-if-range)#interface port-channel 1

S1(config-if)#switchport mode trunk
----------------------------------------------
S2(config)#interface range fa0/1-3

S2(config-if-range)#channel-group 1 mode active

S2(config-if-range)#interface port-channel 1

S2(config-if)#switchport mode trunk

```

- Estado del port channel
	`sh ip interface brief`
- Para obtener datos del port channel, velocidad, etc.
	`sh interface port-channel 1`
- Verificar si etherchannel esta arriba y que tipo de etherchannel es:
	`sh etherchannel summary`
