#FHRP #HSRP
# FHRP (First Hop Redundancy Protocol)
- Protocolo usado para la redundancia en routers
- Se necesita un router activo y una o más en standby
- Se configura una IP virtual y se crea una MAC virtual
- En el modelo OSI capa3
# HSRP (Hot Standby Redundancy Protcol)
- Implementación de FHRP de cisco
- Para elegir el **router activo se necesita configurar una prioridad más alta** que a los routers standby
- Se usará versión 2 por la cantidad de grupos que soporta
- Tiempo: 
	- Hello -> 3 seg
	- Hold -> 10 seg
- En el modelo OSI capa3
## Comando FHRP y HSRP
``` js
Rx(conf)#interface fax/x, gix/x
		#standby x ip <ip virtual>
		#standby x priority y
		#standby x preempt //Solo va en el router activo
Dónde: x= no grupo
		y= prioridad
```

---
``` js
R1(conf)#interface fa0/0
		#standby ? 
		#standby 1 ip 192.168.1.100
		#standby 1 priority ?
		#standby 1 priority 200
		#standby 1 preempt //Router 1 será activo

R2(conf)#interface fa0/0
		#standby ? 
		#standby 1 ip 192.168.1.100
		#standby 1 priority ?
		#standby 1 priority 200
		//#standby 1 preempt //Router 2 sin preempt
		#show standby
```

---
### Traceroute
-> Solo viaja de ida
Linux-Mac = traceroute IP
Windows = tracert IP

---
# DCHP
#DHCP
- UDP 

![[dhcp1.JPG]]

``` js
R3(conf)#ip dhcp pool PC1
		#network 192.168.1.0 255.255.255.0
		#default-router 192.168.1.254

R1(conf)#interface fa0/0
		#ip helper-address 192.168.4.2
```
---
``` js
R1(conf)#ip dhcp pool PC1
		#network 192.168.3.0 255.255.255.0
		#default-router 192.168.3.254

R3(conf)#interface fa0/0
		#ip helper-address 192.168.2.1
```

---
# DCHP Snooping
- Configura interface en switch para hacer más confiables las solicitudes dchp
![[dhcp2.JPG]]

``` js
S1(config)#ip dhcp snooping

S1(config)#ip dhcp snooping vlan 1

S1(config)#interface fa0/1

S1(config-if)#ip dhcp snooping trust

S1(config-if)#exit

S1(config)#interface fa0/2

S1(config-if)#ip dhcp snooping trust
```

![[dhcp3.JPG]]
``` js
R2(conf)#interface fa0/0
		#no shutdown
		#ip address dhcp
---------------------------------------------
R4(conf)#interface se0/0/0
		#no shutdown
		#ip address dhcp
```

**En R4 no se puede hacer DHCP porque en el proceso DORA, al hacer Discover se ocupa un mensaje Broadcast, y en una WAN no existe mensaje Broadcast.**
